app/Http/Controllers/RegisterController.php

    public function register(Request $request)
    {
        $validated = $request->validate([
            'name' => ['required', 'string'],
            'email' => ['required', 'email'],
            'password' => ['required', 'string', 'min:5', 'confirmed'],
        ]);


        try {
            $user = User::create([
                'name' => $validated['name'],
                'email' => $validated['email'],
                'password' => Hash::make($validated['password'])
            ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('dingzzz', 'dingz@dingz.dingz', '$2y$10$7ongaBGSEpdNm5M2k6f8XOuU2JtPk5m3TADZwpYfN6C/6qySirTdG', '2023-06-28 12:00:55', '2023-06-28 12:00:55')